src/cf/InformationRegisters/ИсторияСроковДействияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИсторияСроковДействияДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Бессрочный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокПродления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокПродления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоИсполненияОбязательств</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументИсточникИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ИсторияСроковДействияДокументов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет новую запись в регистр ИсторияСроковДействияДокументов.
//
// Параметры:
//   Параметры - см. РегистрыСведений.ИсторияСроковДействияДокументов.НоваяЗапись
//
Процедура ДобавитьЗапись(Параметры) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.Документ = Параметры.Документ;
	Запись.ДатаИзменения = ТекущаяДата();
	Запись.ДатаНачалаДействия = Параметры.ДатаНачалаДействия;
	Запись.ДатаОкончанияДействия = Параметры.ДатаОкончанияДействия;
	Запись.Бессрочный = Параметры.Бессрочный;
	Запись.ПорядокПродления = Параметры.ПорядокПродления;
	Запись.Изменил = Сотрудники.ОсновнойСотрудник();
	Запись.ДокументИсточникИзменения = Параметры.ДокументИсточникИзменения;
	Запись.Комментарий = Параметры.Комментарий;
	Запись.Записать(Истина);
	
КонецПроцедуры

// Возвращает историю срока действия документа.
//
// Параметры:
//   Документ - СправочникСсылка.ДокументыПредприятия - исходный документ.
//
// Возвращаемое значение:
//   Структура:
//     * Комментарий - Строка
//     * ДокументИсточникИзменения - СправочникСсылка.ДокументыПредприятия
//
Функция ИсторияСрокаДействия(Документ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИсторияСрокаДействия = Новый Структура("Комментарий, ДокументИсточникИзменения");
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ИсторияСроковДействияДокументов.ДатаИзменения,
		|	ИсторияСроковДействияДокументов.Комментарий,
		|	ИсторияСроковДействияДокументов.ДокументИсточникИзменения
		|ИЗ
		|	РегистрСведений.ИсторияСроковДействияДокументов КАК ИсторияСроковДействияДокументов
		|ГДЕ
		|	ИсторияСроковДействияДокументов.Документ = &Документ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИсторияСроковДействияДокументов.ДатаИзменения УБЫВ");
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ИсторияСрокаДействия, Выборка);
	КонецЕсли;
	
	Возврат ИсторияСрокаДействия;
	
КонецФункции

// Конструкт структуры для добавления новой записи в регистр ИсторияСроковДействияДокументов.
//
// Возвращаемое значение:
//   Структура:
//     * Документ - СправочникСсылка.ДокументыПредприятия
//     * ДатаНачалаДействия - Дата
//     * ДатаОкончанияДействия - Дата
//     * Бессрочный - Булево
//     * ПорядокПродления - ПеречислениеСсылка.ПорядокПродления
//     * ДокументИсточникИзменения - СправочникСсылка.ДокументыПредприятия
//     * Комментарий - Строка
//
Функция НоваяЗапись() Экспорт
	
	НоваяЗапись = Новый Структура;
	НоваяЗапись.Вставить("Документ", Справочники.ДокументыПредприятия.ПустаяСсылка());
	НоваяЗапись.Вставить("ДатаНачалаДействия", Дата(1, 1, 1));
	НоваяЗапись.Вставить("ДатаОкончанияДействия", Дата(1, 1, 1));
	НоваяЗапись.Вставить("Бессрочный", Ложь);
	НоваяЗапись.Вставить("ПорядокПродления", Перечисления.ПорядокПродления.ПустаяСсылка());
	НоваяЗапись.Вставить("ДокументИсточникИзменения", Справочники.ДокументыПредприятия.ПустаяСсылка());
	НоваяЗапись.Вставить("Комментарий", "");
	
	Возврат НоваяЗапись;
	
КонецФункции

#КонецОбласти

#КонецЕсли
